app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("updated_at", "title", "body", "created_at") VALUES('2009-09-15 07:25:21', 'Kristina Queen of Vampires Chapter 2', 'The art was once again excellent. Mensink uses vibrant colors, the proportions were spot on and the people didn''t look cartoonish. The sex was hot and explicitly rendered, as in the first installment. However, this "novel" is shorter and the story was a disappointing follow-up to chapter one.

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "title" = 'Peanut Butter', "body" = 'Megahot, superslick Spanish superhero artist Fonteriz brings us this graphic-novel length tale of intrigue, murder, and betrayal starring Quim Queen, Vulvita, and Thunderpussy! This astonishingly well-drawn graphic novel features all the stories from the original comic book series plus a new Christmas story and a gallery portfolio section!', "updated_at" = '2009-09-15 07:11:09' WHERE "id" = 1